In [ ]:
"""
Swap Salary

Table: Salary

+-------------+----------+
| Column Name | Type     |
+-------------+----------+
| id          | int      |
| name        | varchar  |
| sex         | ENUM     |
| salary      | int      |
+-------------+----------+
id is the primary key for this table.
The sex column is ENUM value of type ('m', 'f').
The table contains information about an employee.
 

Write an SQL query to swap all 'f' and 'm' values (i.e., change all 'f' values to 'm' and vice versa) with a single update statement and no intermediate temp table(s).

Note that you must write a single update statement, DO NOT write any select statement for this problem.
"""

In [ ]:
"""testcase"""
{"headers":{"salary":["id","name","sex","salary"]},
 "rows":{"salary":[[1,"A","m",2500],[2,"B","f",1500],[3,"C","m",5500],[4,"D","f",500]]}}

In [ ]:
"""SQL table creation and data insertion"""
DROP TABEL IF EXISTS Salary;

CREATE TABLE Salary(
id int(4) NOT NULL,
name varchar(50) NOT NULL,
sex enum('f', 'm') NOT NULL,
salary int(10) NOT NULL);

INSERT INTO Salary VALUES
(1,"A","m",2500),
(2,"B","f",1500),
(3,"C","m",5500),
(4,"D","f",500);

In [ ]:
"""SQL solution"""
# 1 210 ms
UPDATE Salary
SET sex = IF(sex = 'f', 'm', 'f')

# 2 202 ms
UPDATE Salary
SET sex = CASE WHEN sex = 'f' THEN 'm' ELSE 'f' END

# 3 278 ms
UPDATE Salary
SET sex = CHAR(ASCII('f') + ASCII('m') - ASCII(sex))

# 4 184 ms
UPDATE Salary
SET sex = CHAR(ASCII('f') ^ ASCII('m') ^ ASCII(sex))

# 5 254 ms
UPDATE Salary
SET sex = REPLACE('fm', sex, '')

In [14]:
"""pandas dataframe creation"""
import pandas as pd

testcase = {"headers":{"salary":["id","name","sex","salary"]},
 "rows":{"salary":[[1,"A","m",2500],[2,"B","f",1500],[3,"C","m",5500],[4,"D","f",500]]}}

Salary = pd.DataFrame(testcase['rows']['salary'], columns=testcase['headers']['salary'])
Salary.head()

   id name sex  salary
0   1    A   m    2500
1   2    B   f    1500
2   3    C   m    5500
3   4    D   f     500

In [15]:
Salary['sex'].replace(to_replace=['f', 'm'], value=['m', 'f'], inplace=True)
Salary

   id name sex  salary
0   1    A   f    2500
1   2    B   m    1500
2   3    C   f    5500
3   4    D   m     500